In [1]:
# Configuração para não exibir os warnings
import warnings
warnings.filterwarnings("ignore")
import pandas as pd

In [3]:
#importando todos os csv com o valores

df_baixada = pd.read_csv('./VALORES_POR_LOCALIDADE/Baixada_Fluminense_Valores.csv', delimiter=';')

df_capita = pd.read_csv('./VALORES_POR_LOCALIDADE/Capital_Valores.csv', delimiter=';')

df_norte_fluminense = pd.read_csv('./VALORES_POR_LOCALIDADE/Norte_Fluminense_valores.csv', delimiter=';')

df_regiao_serrana = pd.read_csv('./VALORES_POR_LOCALIDADE/regiao_serrana_Valores.csv', delimiter=';')

df_sul_fluminense = pd.read_csv('./VALORES_POR_LOCALIDADE/Sul_Fluminense_Valores.csv', delimiter=';')

In [11]:
df_baixada.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 333 entries, 0 to 332
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           333 non-null    object
 1   Cidade         333 non-null    object
 2   Bairro         291 non-null    object
 3   Valor_entrega  333 non-null    object
 4   Tipo_veiculo   333 non-null    object
dtypes: object(5)
memory usage: 13.1+ KB

In [12]:
df_capita.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 270 entries, 0 to 269
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           270 non-null    object
 1   Cidade         270 non-null    object
 2   Bairro         228 non-null    object
 3   Valor_entrega  270 non-null    object
 4   Tipo_veiculo   270 non-null    object
dtypes: object(5)
memory usage: 10.7+ KB

In [13]:
df_norte_fluminense.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132 entries, 0 to 131
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           132 non-null    object
 1   Cidade         132 non-null    object
 2   Bairro         12 non-null     object
 3   Valor_entrega  132 non-null    object
 4   Tipo_veiculo   132 non-null    object
dtypes: object(5)
memory usage: 5.3+ KB

In [14]:
df_regiao_serrana.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           375 non-null    object
 1   Cidade         375 non-null    object
 2   Bairro         312 non-null    object
 3   Valor_entrega  375 non-null    object
 4   Tipo_veiculo   375 non-null    object
dtypes: object(5)
memory usage: 14.8+ KB

In [15]:
df_sul_fluminense.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           84 non-null     object
 1   Cidade         84 non-null     object
 2   Bairro         18 non-null     object
 3   Valor_entrega  84 non-null     object
 4   Tipo_veiculo   84 non-null     object
dtypes: object(5)
memory usage: 3.4+ KB

In [16]:
#concatenando os dataframes

df_valores = pd.concat([df_baixada,df_capita,df_norte_fluminense,df_regiao_serrana,df_sul_fluminense])

In [17]:
df_valores.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1194 entries, 0 to 83
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           1194 non-null   object
 1   Cidade         1194 non-null   object
 2   Bairro         861 non-null    object
 3   Valor_entrega  1194 non-null   object
 4   Tipo_veiculo   1194 non-null   object
dtypes: object(5)
memory usage: 56.0+ KB

In [18]:
df_valores.head()

         Base       Cidade Bairro Valor_entrega Tipo_veiculo
0  CD NVI 001  NOVA IGUAÇU    NaN           2,8        CARRO
1  CD NVI 001  NOVA IGUAÇU  KM 32           3,7        CARRO
2  CD NVI 001    QUEIMADOS    NaN           2,8        CARRO
3  CD NVI 001     MESQUITA    NaN           2,8        CARRO
4  CD NVI 001       JAPERI    NaN             3        CARRO

In [20]:
#verificando os valores nulo
df_valores.isnull().sum()

Base               0
Cidade             0
Bairro           333
Valor_entrega      0
Tipo_veiculo       0
dtype: int64

In [22]:
#modificando os ' Nan ' para 'BAIRRO INEXISTENTE'
df_valores['Bairro'] = df_valores['Bairro'].fillna('BAIRRO INEXISTENTE')

#Exibindo

df_valores.head()

         Base       Cidade              Bairro Valor_entrega Tipo_veiculo
0  CD NVI 001  NOVA IGUAÇU  BAIRRO INEXISTENTE           2,8        CARRO
1  CD NVI 001  NOVA IGUAÇU               KM 32           3,7        CARRO
2  CD NVI 001    QUEIMADOS  BAIRRO INEXISTENTE           2,8        CARRO
3  CD NVI 001     MESQUITA  BAIRRO INEXISTENTE           2,8        CARRO
4  CD NVI 001       JAPERI  BAIRRO INEXISTENTE             3        CARRO

In [23]:
df_valores.isnull().sum()

Base             0
Cidade           0
Bairro           0
Valor_entrega    0
Tipo_veiculo     0
dtype: int64

In [26]:
#modificando a virgula para ponto
df_valores['Valor_entrega'] = df_valores['Valor_entrega'].str.replace(',','.')

#exibindo o dataframe
df_valores.head()

         Base       Cidade              Bairro Valor_entrega Tipo_veiculo
0  CD NVI 001  NOVA IGUAÇU  BAIRRO INEXISTENTE           2.8        CARRO
1  CD NVI 001  NOVA IGUAÇU               KM 32           3.7        CARRO
2  CD NVI 001    QUEIMADOS  BAIRRO INEXISTENTE           2.8        CARRO
3  CD NVI 001     MESQUITA  BAIRRO INEXISTENTE           2.8        CARRO
4  CD NVI 001       JAPERI  BAIRRO INEXISTENTE             3        CARRO

In [27]:
#Transformando a coluna especifica para o tipo float

df_valores['Valor_entrega'] = df_valores['Valor_entrega'].astype(float)

#exibindo
df_valores.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1194 entries, 0 to 83
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Base           1194 non-null   object
 1   Cidade         1194 non-null   object
 2   Bairro         1194 non-null   object
 3   Valor_entrega  1194 non-null   float64
 4   Tipo_veiculo   1194 non-null   object
dtypes: float64(1), object(4)
memory usage: 56.0+ KB

In [39]:
#colocando todas as row das linhas em maíusculo

df_valores['Bairro'] = df_valores['Bairro'].str.upper()

df_valores['Cidade'] = df_valores['Cidade'].str.upper()

df_valores['Base'] =df_valores['Base'].str.upper()

#exibindo o dataframe

df_valores.head()

         Base       Cidade              Bairro  Valor_entrega Tipo_veiculo
0  CD NVI 001  NOVA IGUAÇU  BAIRRO INEXISTENTE            2.8        CARRO
1  CD NVI 001  NOVA IGUAÇU               KM 32            3.7        CARRO
2  CD NVI 001    QUEIMADOS  BAIRRO INEXISTENTE            2.8        CARRO
3  CD NVI 001     MESQUITA  BAIRRO INEXISTENTE            2.8        CARRO
4  CD NVI 001       JAPERI  BAIRRO INEXISTENTE            3.0        CARRO

In [40]:
#Salvando em CSV

df_valores.to_csv('./valores_localidade.csv', encoding='utf-16')